"app.title" = "Mac Sistem Bilgileri";
"cpu.title" = "CPU";
"cpu.usage" = "Kullanım: %.1f%%";
"cpu.cores" = "Çekirdek Kullanımları";

"ram.title" = "Bellek";
"ram.usage" = "%.1f%% Kullanım";

"disk.title" = "Disk";
"disk.usage" = "%.1f%% Kullanım";

"network.title" = "Ağ";

"info.title" = "Genel Bilgiler";
"info.host" = "Bilgisayar Adı";
"info.model" = "Model";
"info.os" = "İşletim Sistemi";
"info.processor" = "İşlemci";
"info.ramTotal" = "Toplam Bellek";
"info.diskTotal" = "Toplam Alan";
"info.localIP" = "Yerel IP";
"info.publicIP" = "Genel IP";
"info.temp" = "Sıcaklık Durumu";

"button.settings" = "Ayarlar";
"button.quit" = "Çıkış";
"button.save" = "Kaydet";
"button.close" = "Kapat";
"button.help" = "Yardım";
"button.report" = "Rapor";
"button.contact" = "İletişim";
"button.showWindow" = "Pencere";
"report.title" = "Sistem Raporu";
"report.subtitle" = "Donanım ve yazılım detaylarının özeti";
"report.hardware" = "Donanım Özellikleri";
"report.network" = "Ağ Bilgileri";
"report.status" = "Anlık Durum";
"report.copy" = "Raporu Kopyala";
"report.print" = "Yazdır";
"report.date" = "Rapor Tarihi";

"settings.title" = "Ayarlar";
"settings.general" = "Genel";
"settings.advanced" = "Gelişmiş";

"settings.view.title" = "Görünüm";
"settings.view.showWindow" = "Pencere Olarak Göster";
"settings.view.showCores" = "Çekirdek Kullanımını Göster";
"settings.view.showNetwork" = "Ağ Kullanımını Göster";
"settings.view.showDisk" = "Disk Kullanımını Göster";

"settings.monitor.title" = "Sistem Monitörü";
"settings.monitor.toggle" = "Arka Planda Verileri Güncelle";
"settings.monitor.energyMode" = "Enerji Tasarruf Modu";
"settings.monitor.refreshTime" = "Yenileme Hızı: %.1f sn";
"settings.monitor.reset" = "CPU ve Ağ Geçmişini Sıfırla";

"settings.theme.title" = "Görünüm Teması";
"settings.theme.label" = "Tema";
"settings.theme.auto" = "Sistem";
"settings.theme.light" = "Açık";
"settings.theme.dark" = "Koyu";
"menu.startup.title" = "Başlangıç";
"menu.startup.enable" = "Otomatik Başlat";
"menu.startup.disable" = "Otomatik Başlatmayı Kapat";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Ilık";
"temp.hot" = "Sıcak 🔥";
"temp.critical" = "Kritik 🚨";
"temp.unknown" = "Bilinmiyor";
"ip.loading" = "Yükleniyor...";
"ip.notFound" = "Bulunamadı";
"unknown" = "Bilinmiyor";

"settings.language.title" = "Dil / Language";
"settings.language.system" = "Sistem Varsayılanı";
"settings.language.restart" = "Değişikliklerin etkili olması için uygulamayı yeniden başlatın.";
"contact.social" = "Sosyal Medya";
"app.running_in_menu" = "Uygulama menü çubuğunda çalışıyor";
"app.window_mode_hint" = "Pencere görünümünü Menü Çubuğu > Ayarlar > Görünüm sekmesinden aktif edebilirsiniz.";

"help.title" = "Yardım";
"help.subtitle" = "Sistem Bilgi – Tüm özellikler ve kullanım kılavuzu";
"help.version" = "Sistem Bilgi – Versiyon 1.1  •  macOS 15+";
"help.developer" = "Geliştirici: ModelPC";

"help.cpu.title" = "CPU Kullanımı";
"help.cpu.desc" = "Anlık ve tarihi işlemci kullanım yüzdesi gösterilir. CPU grafiği son 30 ölçümün trendi izler. %80 üzerinde kırmızıya döner ve uyarı yanıp söner. Çok çekirdekli işlemcilerde her çekirdeğin ayrı kullanımını Ayarlar > Görünüm > 'Çekirdek Kullanımını Göster' seçeneğiyle etkinleştirebilirsiniz.";

"help.ram.title" = "Bellek (RAM) Kullanımı";
"help.ram.desc" = "Aktif, inaktif ve sabit sayfaların toplamı kullanılmış bellek olarak hesaplanır. Yüzde olarak gösterilir; mavi progress bar ile anlık durumu izleyebilirsiniz.";

"help.disk.title" = "Disk Kullanımı";
"help.disk.desc" = "Ana diskinizin (/) toplam kapasitesi ve kullanılan alan yüzdesel olarak gösterilir. Disk kartını Ayarlar > Görünüm > 'Disk Kullanımını Göster' seçeneğiyle gizleyebilirsiniz.";

"help.network.title" = "Ağ Kullanımı";
"help.network.desc" = "Tüm ağ arayüzlerinden geçen toplam indirme + yükleme hızını KB/s cinsinden gösterir. Grafik, son 30 ölçümü dinamik ölçekte görselleştirir. Ağ kartını Ayarlar > Görünüm > 'Ağ Kullanımını Göster' seçeneğiyle gizleyebilirsiniz.";

"help.temp.title" = "Sıcaklık Durumu";
"help.temp.desc" = "macOS'un ThermalState API'si üzerinden sistem ısı sevisi okunur: Normal 🌡, Ilık, Sıcak 🔥 ve Kritik 🚨. Tam derece değeri Apple tarafından üçüncü taraflara açılmamaktadır.";

"help.settings.title" = "Ayarlar & Özelleştirme";
"help.settings.desc" = "Menü çubuğu simgesine tıklayıp Ayarlar'a girin. Görünüm sekmesinde kartları açıp kapatabilirsiniz. Gelişmiş sekmesinde Açık / Koyu / Otomatik tema seçebilirsiniz. Yenileme hızını 0,5 ile 5 saniye arasında ayarlayabilirsiniz. Enerji Tasarruf Modu aktif değilken güncelleme sıklığını düşürür.";

"help.menubar.title" = "Menü Çubuğu & Pencere Modu";
"help.menubar.desc" = "Uygulama varsayılan olarak menü çubuğunda çalışır. Ayarlar > Görünüm > 'Pencere Olarak Göster' seçeneğini açarak bağımsız pencere moduna geçilebilir. Menü çubuğu etiketi anlık CPU yüzdesini ve mini grafik gösterir.";

"contact.title" = "İletişim";
"contact.subtitle" = "Geliştiriciye ulaşın veya sosyal medyada takip edin";
"contact.email.title" = "E-posta Gönder";
"contact.email.address" = "Resmi Destek (info@modelpc.com)";
"contact.email.address2" = "Geliştirici (modelpc91@gmail.com)";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Web Sitesi";

